<?php
if (! defined('BASEPATH'))
	exit('No direct script access allowed');
class Common_mo extends CI_Model
{
	public function __construct()
	{
		parent::__construct();
		$this->load->database();
	}

	/**
	 * 国コードから国名称を取得
	 */
	public function getCountryValue($country_cd)
	{
		//国コードリスト
		$country_arr = array(
			"1" => "日本",
			"2" => "アイスランド",
			"3" => "ジンバブエ",
			"4" => "ザンビア",
			"5" => "ザイール",
			"6" => "南アフリカ",
			"7" => "ユーゴスラビア",
			"8" => "イエメン",
			"9" => "サモア",
			"10" => "ウォリス・フツナ",
			"11" => "バヌアツ",
			"12" => "ベトナム",
			"13" => "アメリカ領ヴァージン諸島",
			"14" => "イギリス領ヴァージン諸島",
			"15" => "ベネズエラ",
			"16" => "セントビンセント・グレナディーン",
			"17" => "バチカン",
			"18" => "ウズベキスタン",
			"19" => "アメリカ",
			"20" => "ウルグアイ",
			"21" => "合衆国領有小離島",
			"22" => "ウクライナ",
			"23" => "ウガンダ",
			"24" => "タンザニア",
			"25" => "台湾",
			"26" => "ツバル",
			"27" => "トルコ",
			"28" => "チュニジア",
			"29" => "トリニダード・トバゴ",
			"30" => "トンガ",
			"31" => "東ティモール",
			"32" => "トルクメニスタン",
			"33" => "トケラウ",
			"34" => "タジキスタン",
			"35" => "タイ",
			"36" => "トーゴ",
			"37" => "チャド",
			"38" => "タークス・カイコス諸島",
			"39" => "シリア",
			"40" => "セーシェル",
			"41" => "シント・マールテン島",
			"42" => "スワジランド",
			"43" => "スウェーデン",
			"44" => "スロベニア",
			"45" => "スロバキア",
			"46" => "スリナム",
			"47" => "サントメ・プリンシペ",
			"48" => "セルビア",
			"49" => "サンピエール島・ミクロン島",
			"50" => "ソマリア",
			"51" => "サンマリノ",
			"52" => "エルサルバドル",
			"53" => "シエラレオネ",
			"54" => "ソロモン諸島",
			"55" => "スヴァールバル諸島,ヤンマイエン島",
			"56" => "セントヘレナ・アセンション,トリスタン・ダ・クーニャ",
			"57" => "サウスジョージア・サウスサンドウィッチ諸島",
			"58" => "シンガポール",
			"59" => "セネガル",
			"60" => "スーダン",
			"61" => "セルビア・モンテネグロ",
			"62" => "サウジアラビア",
			"63" => "ルワンダ",
			"64" => "ロシア",
			"65" => "ルーマニア",
			"66" => "パラオ共和国",
			"67" => "ルーマニア",
			"68" => "レユニオン",
			"69" => "カタール",
			"70" => "フランス領ポリネシア",
			"71" => "パレスチナ",
			"72" => "パラグアイ",
			"73" => "ポルトガル",
			"74" => "北朝鮮",
			"75" => "プエルトリコ",
			"76" => "ポーランド",
			"77" => "パプアニューギニア",
			"78" => "パラオ",
			"79" => "フィリピン",
			"80" => "ペルー",
			"81" => "ピトケアン",
			"82" => "パナマ",
			"83" => "パキスタン",
			"84" => "オマーン",
			"85" => "ニュージーランド",
			"86" => "ナウル",
			"87" => "ネパール",
			"88" => "ノルウェー",
			"89" => "オランダ",
			"90" => "ニウエ",
			"91" => "ニカラグア",
			"92" => "ナイジェリア",
			"93" => "ノーフォーク島",
			"94" => "ニジェール",
			"95" => "ニューカレドニア",
			"96" => "ナミビア",
			"97" => "マヨット",
			"98" => "マレーシア",
			"99" => "マラウイ",
			"100" => "モーリシャス",
			"101" => "マルティニーク",
			"102" => "モントセラト",
			"103" => "モーリタニア",
			"104" => "モザンビーク",
			"105" => "北マリアナ諸島",
			"106" => "モンゴル",
			"107" => "モンテネグロ",
			"108" => "ミャンマー",
			"109" => "マルタ",
			"110" => "マリ",
			"111" => "マケドニア共和国",
			"112" => "マーシャル諸島",
			"113" => "メキシコ",
			"114" => "モルディブ",
			"115" => "マダガスカル",
			"116" => "モルドバ",
			"117" => "モナコ",
			"118" => "モロッコ",
			"119" => "サン・マルタン島",
			"120" => "マカオ",
			"121" => "ラトビア",
			"122" => "ルクセンブルク",
			"123" => "リトアニア",
			"124" => "レソト",
			"125" => "スリランカ",
			"126" => "リヒテンシュタイン",
			"127" => "セントルシア",
			"128" => "リビア",
			"129" => "リベリア",
			"130" => "レバノン",
			"131" => "ラオス",
			"132" => "クウェート",
			"133" => "韓国",
			"134" => "セントクリストファー・ネイビス",
			"135" => "キリバス",
			"136" => "カンボジア",
			"137" => "キルギス",
			"138" => "ケニア",
			"139" => "カザフスタン",
			"140" => "ヨルダン",
			"141" => "ジャージー",
			"142" => "ジャマイカ",
			"143" => "イタリア",
			"144" => "イスラエル",
			"145" => "イラク",
			"146" => "イラン",
			"147" => "アイルランド",
			"148" => "イギリス領インド洋地域",
			"149" => "インド",
			"150" => "マン島",
			"151" => "インドネシア",
			"152" => "ハワイ（アメリカ）",
			"153" => "ハンガリー",
			"154" => "ハイチ",
			"155" => "クロアチア",
			"156" => "ホンジュラス",
			"157" => "ハード島,マクドナルド諸島",
			"158" => "香港",
			"159" => "ガイアナ",
			"160" => "グアム",
			"161" => "フランス領ギアナ",
			"162" => "グアテマラ",
			"163" => "グリーンランド",
			"164" => "グレナダ",
			"165" => "ギリシャ",
			"166" => "赤道ギニア",
			"167" => "ギニアビサウ",
			"168" => "ガンビア",
			"169" => "グアドループ",
			"170" => "ギニア",
			"171" => "ジブラルタル",
			"172" => "ガーナ",
			"173" => "ガーンジー",
			"174" => "グルジア",
			"175" => "イギリス",
			"176" => "ガボン",
			"177" => "ミクロネシア連邦",
			"178" => "フェロー諸島",
			"179" => "フランス",
			"180" => "フォークランド諸島",
			"181" => "フィジー",
			"182" => "フィンランド",
			"183" => "エチオピア",
			"184" => "エストニア",
			"185" => "スペイン",
			"186" => "西サハラ",
			"187" => "エリトリア",
			"188" => "エジプト",
			"189" => "エクアドル",
			"190" => "アルジェリア",
			"191" => "ドミニカ共和国",
			"192" => "デンマーク",
			"193" => "ドミニカ国",
			"194" => "ジブチ",
			"195" => "ドイツ",
			"196" => "チェコ",
			"197" => "キプロス",
			"198" => "ケイマン諸島",
			"199" => "クリスマス島",
			"200" => "キュラソー",
			"201" => "キューバ",
			"202" => "コスタリカ",
			"203" => "カーボベルデ",
			"204" => "コモロ",
			"205" => "コロンビア",
			"206" => "クック諸島",
			"207" => "コンゴ共和国",
			"208" => "コンゴ民主共和国",
			"209" => "カメルーン",
			"210" => "コートジボワール",
			"211" => "中国",
			"212" => "チリ",
			"213" => "スイス",
			"214" => "コンゴ民主共和国",
			"215" => "ココス諸島",
			"216" => "カナダ",
			"217" => "中央アフリカ",
			"218" => "ボツワナ",
			"219" => "ブーベ島",
			"220" => "ブータン",
			"221" => "ブルネイ",
			"222" => "バルバドス",
			"223" => "ブラジル",
			"224" => "ボリビア",
			"225" => "バミューダ諸島",
			"226" => "ベリーズ",
			"227" => "ベラルーシ",
			"228" => "サン・バルテルミー島",
			"229" => "ボスニア・ヘルツェゴビナ",
			"230" => "バハマ",
			"231" => "バーレーン",
			"232" => "ブルガリア",
			"233" => "バングラデシュ",
			"234" => "ブルキナファソ",
			"235" => "ボネール、シント・ユースタティウス,サバ",
			"236" => "ベナン",
			"237" => "ベルギー",
			"238" => "ブルンジ",
			"239" => "アゼルバイジャン",
			"240" => "オーストリア",
			"241" => "オーストラリア",
			"242" => "アンティグア・バーブーダ",
			"243" => "フランス領南方・南極地域",
			"244" => "南極",
			"245" => "アメリカ領サモア",
			"246" => "アルメニア",
			"247" => "アルゼンチン",
			"248" => "アラブ首長国連邦",
			"249" => "オランダ領アンティル",
			"250" => "アンドラ",
			"251" => "アルバニア",
			"252" => "オーランド諸島",
			"253" => "アンギラ",
			"254" => "アンゴラ",
			"255" => "アフガニスタン",
			"256" => "アルバ"
		);
		if (empty($country_cd)) {
			return "";
		}

		if (array_key_exists($country_cd, $country_arr)) {
			return $country_arr[$country_cd];
		} else {
			return "";
		}
	}

	/**
	 * 都道府県コードから都道府県名称を取得
	 */
	public function getPrefectureValue($prefecture_cd)
	{

		$prefecture_arr = array(
			"1" => "北海道",
			"2" => "青森県",
			"3" => "岩手県",
			"4" => "宮城県",
			"5" => "秋田県",
			"6" => "山形県",
			"7" => "福島県",
			"8" => "茨城県",
			"9" => "栃木県",
			"10" => "群馬県",
			"11" => "埼玉県",
			"12" => "千葉県",
			"13" => "東京都",
			"14" => "神奈川県",
			"15" => "新潟県",
			"16" => "富山県",
			"17" => "石川県",
			"18" => "福井県",
			"19" => "山梨県",
			"20" => "長野県",
			"21" => "岐阜県",
			"22" => "静岡県",
			"23" => "愛知県",
			"24" => "三重県",
			"25" => "滋賀県",
			"26" => "京都府",
			"27" => "大阪府",
			"28" => "兵庫県",
			"29" => "奈良県",
			"30" => "和歌山県",
			"31" => "鳥取県",
			"32" => "島根県",
			"33" => "岡山県",
			"34" => "広島県",
			"35" => "山口県",
			"36" => "徳島県",
			"37" => "香川県",
			"38" => "愛媛県",
			"39" => "高知県",
			"40" => "福岡県",
			"41" => "佐賀県",
			"42" => "長崎県",
			"43" => "熊本県",
			"44" => "大分県",
			"45" => "宮崎県",
			"46" => "鹿児島県",
			"47" => "沖縄県"
		);

		if (empty($prefecture_cd)) {
			return "";
		}

		if (array_key_exists($prefecture_cd, $prefecture_arr)) {
			return $prefecture_arr[$prefecture_cd];
		} else {
			return "";
		}
	}

	/**
	 * csv出力用
	 * 
	 * @param unknown $row
	 */
	public function get_csv_row($data)
	{
		if ($data == null || $data == "") {
			return "";
		} else {
			if (isset($data['R00_kibou'])) {
				if ($data['R00_kibou'] == 'XX') {
					$data['R00_kibou'] = '参加しない';
				}
				if ($data['R00_kibou'] == 1) {
					$data['R00_kibou'] = '1班';
				}
				if ($data['R00_kibou'] == 2) {
					$data['R00_kibou'] = '2班';
				}
			} else {
				$data['R00_kibou'] == '';
			}
			if ($data['R00_Update_date'] == "0000-00-00 00:00:00") {
				$data['R00_Update_date'] = "";
			} else {
				$data['R00_Update_date'] = $data['R00_Update_date'];
			}


			if (isset($data['R00_Sex'])) {
				if ($data['R00_Sex'] == 0) {
					$data['R00_Sex'] = "男性";
				} elseif ($data['R00_Sex'] == 1) {
					$data['R00_Sex'] = "女性";
				}
			} else {
				$data['R00_Sex'] == '';
			}
			if (isset($data['R00_Passport_Issue'])) {
				if ($data['R00_Passport_Issue'] == '0000-00-00') {
					$data['R00_Passport_Issue'] = "";
				} else {
					$data['R00_Passport_Issue'] = $data['R00_Passport_Issue'];
				}
			} else {
				$data['R00_Passport_Issue'] == '';
			}


			//郵便番号１ 郵便番号２
			if (!empty($data['R01_Prin_Postal_1']) && !empty($data['R01_Prin_Postal_2'])) {
				$data['R01_Prin_Postal_1'] = "〒" . $data['R01_Prin_Postal_1'] . "-" . $data['R01_Prin_Postal_2'];
			} else {
				$data['R01_Prin_Postal_1'] = "";
			}
			unset($data['R01_Prin_Postal_2']);

			//都道府県
			$data['R00_Town'] = $this->getPrefectureValue($data['R00_Town']);


			//会社連絡人　郵便番号１　郵便番号2 
			if (!empty($data['R00_Zip21']) && !empty($data['R00_Zip22'])) {
				$data['R00_Zip'] = "〒" . $data['R00_Zip21'] . "-" . $data['R00_Zip22'];
			} else {
				$data['R00_Zip'] = "";
			}
			unset($data['R00_Zip21']);
			unset($data['R00_Zip22']);

			//レンタル靴
			if (isset($data['R00_Option_shoes'])) {
				if ($data['R00_Option_shoes'] == 1) {
					$data['R00_Option_shoes'] = 'サイズ:' . $data['R00_OptionShoes_Size'] . " cm";
				} elseif ($data['R00_Option_shoes'] == 2) {
					$data['R00_Option_shoes'] = '持参する';
				}
			} else {
				$data['R00_Option_shoes'] = '';
			}

			if (($data['R00_Passport_Upload_Name'] != NULL) && ($data['R00_Passport_Upload_Name'] != "")) {
				$data['R00_Passport_Img'] = 'アップロード済み';
			} else {
				$data['R00_Passport_Img'] = '未アップロード';
			}
			if (isset($data['R00_Prin_Phone'])) {
				if (is_numeric($data['R00_Prin_Phone'])) {
					$data['R00_Prin_Phone'] = "'" . $data['R00_Prin_Phone'];
				} else {
					$data['R00_Prin_Phone'] = $data['R00_Prin_Phone'];
				}
			} else {
				$data['R00_Prin_Phone'] = '';
			}
			if (isset($data['R00_Prin_Fax'])) {
				if (is_numeric($data['R00_Prin_Fax'])) {
					$data['R00_Prin_Fax'] = "'" . $data['R00_Prin_Fax'];
				} else {
					$data['R00_Prin_Fax'] = $data['R00_Prin_Fax'];
				}
			} else {
				$data['R00_Prin_Fax'] = '';
			}
			if (isset($data['R00_emargency_tel'])) {
				if (is_numeric($data['R00_emargency_tel'])) {
					$data['R00_emargency_tel'] = "'" . $data['R00_emargency_tel'];
				} else {
					$data['R00_emargency_tel'] = $data['R00_emargency_tel'];
				}
			} else {
				$data['R00_emargency_tel'] = '';
			}

			//オプショナルツアーについて
			if (isset($data['R00_Optional'])) {
				if ($data['R00_Optional'] == 1) {
					$data['R00_Optional'] = '観光';
				} elseif ($data['R00_Optional'] == 2) {
					$data['R00_Optional'] = 'ゴルフ';
				} elseif ($data['R00_Optional'] == 9) {
					$data['R00_Optional'] = '自由行動';
				} elseif ($data['R00_Optional'] == 0) {
					$data['R00_Optional'] = '';
				}
			} else {
				$data['R00_Optional'] = '';
			}
			//レンタルクラブ
			if (isset($data['R00_Option_golf'])) {
				if ($data['R00_Option_golf'] == 1) {
					$data['R00_Option_golf'] = '右';
				} elseif ($data['R00_Option_golf'] == 2) {
					$data['R00_Option_golf'] = '左';
				} elseif ($data['R00_Option_golf'] == 9) {
					$data['R00_Option_golf'] = '持参する';
				} elseif ($data['R00_Option_golf'] == 0) {
					$data['R00_Option_golf'] = '';
				}
			} else {
				$data['R00_Option_golf'] = '';
			}

			//レンタル靴
			if (isset($data['R00_Option_shoes'])) {
				if ($data['R00_Option_shoes'] == 1) {
					$data['R00_Option_shoes'] = 'サイズ:' . $data['R00_OptionShoes_Size'] . " cm";
				} elseif ($data['R00_Option_shoes'] == 2) {
					$data['R00_Option_shoes'] = '持参する';
				} elseif ($data['R00_Option_shoes'] == 0) {
					$data['R00_Option_shoes'] = '';
				}
			} else {
				$data['R00_Option_shoes'] = '';
			}
			if (isset($data['R00_tabaco'])) {
				if ($data['R00_tabaco'] == 1) {
					$data['R00_tabaco'] = "喫煙";
				} elseif ($data['R00_tabaco'] == 0) {
					$data['R00_tabaco'] = "禁煙";
				}
			} else {
				$data['R00_tabaco'] == '';
			}
		}
		return $data;
	}
	/**
	 *ご集合案内情報取得
	 *
	 */
	public function getFlightInfo($R07_Reservation_No)
	{
		$this->db->select("*");
		$this->db->from("R07_Flight");
		$this->db->join('M08_Map', 'R07_Flight.R07_Place_Map =M08_Map.M08_Airport', 'left');
		$this->db->where("R07_Reservation_No", $R07_Reservation_No);
		$query = $this->db->get();
		$result = $query->row_array();
		if (count($result) > 0) {
			return $result;
		} else {
			return NULL;
		}
	}
}
