
	<section id="about">
	
  
  <div id="main">
  <!-- InstanceBeginEditable name="about" -->
  <!----------------------説明-------------------->
   <p align="left">2日目のフリータイムに、お楽しみいただけるようにオプショナルツアーをご用意しております。<br>
     NO①-観光ツアーは、無料でご参加いただけます。（ビーチアクティビティは含まれておりません）<br>
     皆様のご参加をお待ちしております。</p>
   <p align="left">&nbsp;</p>

<h2 class="h2adjust">■ コースのご案内    </h2>
<tbody>

      <h3>NO①―観光ツアー『セブ島内観光＆（ビーチアクティビティ）』 昼食付き</h3>
  
          <p>ホテル出発後、世界一周で有名なマゼランゆかりの十字架をおさめたマゼランクロス、スペイン統治時代の名残を留めるサンペドロ要塞、サントニーニョ教会、セブで起きた出来事をテーマにしたモニュメント、新鮮な野菜や魚介類を求める庶民で活気あふれるカルボンマーケットにご案内（車窓）いたします。
          14:00頃ホテル到着を予定しており、ご参加希望の方は、ビーチアクティビティーにご参加いただけます。</p>
          <p> ※訪問場所・順番は当日の状況により予告なく変更となる可能性もございますので、予めご了承お願い申し上げます。 </p>
          <p><u>※ビーチアクティビティのご参加料金については、現地にてご参加者様のご負担となります。</u></p>
          <p>
          <strong>＜所要時間＞</strong>約5時間（出発時間09:00・・・・ホテル着14:00頃） 
          </p>
        <p><strong>＜その他＞</strong><u>セブ島の日差しは非常に強いので、日焼け止めなどがあると便利です。水分は細目にお取りください。</u></p>
        <p><u>ビーチアクティビティご希望の方は、水着・タオルをご持参いただきようお願い申し上げます。</u>        
        <p>&nbsp; </p>
        
        <p><img src="<?php echo base_url();?>img/kanko.png">
        <img src="<?php echo base_url();?>img/kanko2.png"></p>
        <p>&nbsp; </p>
        <h3>  NO②―ゴルフツアー『セブカントリークラブ』 昼食付き</h3> 
            <p><strong><u>自己負担：23,000円</u></strong><strong>　　　※レンタルクラブは別途費用が発生いたします。（2,000円） </strong> 旧代のゴルフクラブになります。             </p>
            <p>ご滞在ホテル（プランテーション ベイ リゾート アンド スパ）から車で約60分の場所に位置する老舗名門ゴルフ場です。
              セブ在住の日本人やセブの名士にメンバーが多い格式あるゴルフ場として有名ですが、コースはフラットでビギナーからでも楽しめます。ややドレスコードは厳しく、襟付きシャツの着用など気を配っていただけるようお願いします。
              コースはコンパクトにまとまっていますので繊細なテクニックが試されます。シーズンによって芝の状態がかわるときがありますが、年間を通して緑が濃いのが特徴で水はけもよく、多少の雨でもプレーができるので安心です。 
              ※昼食は、ゴルフクラブハウスにて予定しています。 </p>
            <p><strong>＜所要時間＞</strong>約7時間（出発時間：08:00前後・・・・ホテル到着15:00前後）</p>
            <p>
  </p>
              <p><strong>＜その他＞</strong><u>※ゴルフシューズは各自お持ちください。（要ソフトスパイクシューズ）</u>
                </p>
              <p>&nbsp;</p>
              <img src="<?php echo base_url();?>img/golf.png">
              <img src="<?php echo base_url();?>img/golf2.png">
              <p>&nbsp;</p>
        <p>&nbsp; </p>
        <p>&nbsp; </p>
        <p>&nbsp;</p>
  <!-- InstanceEndEditable -->
  </div>
  

	</section>
	