
	<section id="about">
	
  <div id="main">
  <!-- InstanceBeginEditable name="about" -->

  <h2 class="h2adjust">■パスポートの申請手続きについて</h2>
<span style ="font-weight:bold;font-size:16px;color:#FF0000;text-decoration: underline;text-decoration-style: wavy;">今回のご旅行には、2018年8月9日まで残存のあるパスポートが必要です。</span></br>
また、未使用査証欄が見開き2ページ以上が必要です。<br>
申請から受領までに、通常１週間程度（土・日・休日を除く）かかります。遅くても、12月19日(火)までには申請をお済ませの上、12月27日(水)までに、ツアーサイトのマイページからアップロードしてください。<br>
有効期限が不足している方は、申請手続きをお願いします。
  <p>下記の書類をご持参の上、住民票登録の都道府県パスポート担当窓口にてご申請ください。 なお、一部の都道府県でパスポート業務(申請受付・交付)が都道府県のパスポート担当窓口から市区町村へ移譲されておりますので、ご注意ください。 </p>
  <p>&nbsp;</p>
  <p>&nbsp;</p>
	  <h3>①必要書類をそろえる</h3>
<table width="100%"  class="price">
    <tbody>
      <tr>
        <td width="85%">1.	一般旅券発給申請書（旅券課窓口にございます）</th>
        <td width="15%">1枚</td>
      </tr>
      <tr>
        <td>2.	戸籍抄本（最近6ヶ月以内に発行のもの）
※ 但し、現在有効なパスポートを更新する場合は不要です。
</th>
        <td>1通</td>
      </tr>
      <tr>
        <td><p>3.	住民票の写し　（申請日前6カ月以内に作成されたもの）
         </p>
          <p> ※住民基本台帳ネットワークシステムで確認可能な方については、
            原則不要。国外で申請する場合は不要。 </p></th>
        <td>1通</td>
      </tr>
      <tr>
        <td>4.	写真（最近6ヶ月以内に撮影したもの）
※ふちなし、4.5㎝×3.5㎝、上半身、正面、脱帽、背景無地）
</th>
        <td>1枚</td>
      </tr>
      <tr>
        <td>5.	身元確認書類</th>
        <td>1つ又は2つ</td>
      </tr>
      <tr>
        <td>6.	旅券を以前に取得された方は、その旅券</th>
        <td>1つ</td>
      </tr>
     
    </tbody>
  </table>
  
    <p>&nbsp;</p>
  <p><strong>身元確認書類</strong></p>

<table class="price">
    <tr align="center">
      <th><strong>1点で良い書類（一部省略）</strong></th>
      </tr>
    <tr>
      <td align="left"><p>有効な日本国旅券(都道府県により失効後6ヵ月以内を認める旅券事務所もあり）、 </p>
運転免許証、船員手帳、写真付き住基カード、個人番号カード（マイナンバーカード）など</td>
      </tr>
        <th><strong>2点必要な書類　AとBの各1点、又はAから2点を提示してください。</strong></th>
      </tr>
    <tr>
      <td align="left"><p>A　健康保険証、国民健康保険証、共済組合員証、船員保険証、後期高齢者医療被保険者証、国民年金証書（手帳）、厚生年金証書、船員保険年金 証書、恩給証書、共済年金証書、印鑑登録証明書（この場合は登録した印鑑も必要です）等 <br>
        Ｂ　学生証、会社の身分証明書、公の機関が発行した資格証明書等 </p>
（いずれも写真付きのもの）</td>
      </tr>
 
  </table>
<h3>&nbsp;</h3>
<h3>②申請をする  </h3>
<p>申請者ご本人に代わって代理の方(配偶者、第三者など)が申請書類等を提出することができます。<strong> </strong><br>
  但し、代理申請ができない場合もございます。事前に下記ホームページにてご確認ください。 </p>
 <table class="price">
    <tr align="center">
     
    </tr>
    <tr>
      <td align="center" class="nedan">詳細は外務省ページを
ご参照ください
</td>
      <td align="center" class="nedan"><a href="http://www.mofa.go.jp/mofaj/toko/passport/" target="_blank">http://www.mofa.go.jp/mofaj/toko/passport/</a></td>
    </tr>
    </table><p>&nbsp;</p>
	  <h3>③受領</h3>
	  <p>申請後、受領までに、通常1週間程度かかります。(土・日・休日を除く)　 <br>
	    必ずご本人が発給手数料(10年旅券16,000円/５年旅券11,000円/12歳未満5年旅券6,000円) を <br>
	    ご持参の上、窓口で受領してください。 </p>
	  <p>&nbsp;</p>
<table class="price">
    <tr>
      <td align="center" class="nedan"><p align="center"><strong><u>住民基本台帳ネットワークシステムについて </u></strong><br>
		  <p align="left"> 旅券申請書類の「住民票の写し」で行ってきた申請者の本人確認を「住民基本台帳ネットワークシステム（以下、住基ネット）」により行うことが可能になり、住民票の写しは原則不要となりました。但し、住基ネットに参加していない市区町村にお住まいの方は、申請の際、住民票のうつしが必要となりますので、ご注意ください。詳しくは各都道府県旅券申請窓口またはホームページなどでご確認ください。<br>
       ●住民票の写しが必要な場合 <br>
        ・居所申請の場合　　　・緊急申請の際、戸籍抄本（または謄本）の提出が間に合わない場合 </p>
		  <p align="left"> ・住基ネットを利用して本人確認ができない場合</p></td>
    </tr>
    </table>  <!-- InstanceEndEditable -->
  </div>

	</section>
	